<template>
  <div class="v-basket-item">
    <h2>I'm Basket!</h2>
  </div>
</template>

<script>
export default {
  name: "v-basket-item", // обязательное поле, вводим название нашего компонента
  components: {}, // далее необязательные поля, здесь мы указываем наши дочерние компоненты - объект
  props: {}, // не персональные данные родителя, хранят массив ключей свойств, которым из вне можно передать значение - объект
  data() {
    return {
    };
  },
  computed: {}, // вычисляемые свойства
  methods: {}, // отслеживание действий пользователя, модальные окна и т.д
  watch: {}, // следит за нашим компонентом и что-то отлавливает
  mounted() { // как только появится какой-то компонент, то у нас он отработает
  },
};
</script>

<style>

</style>